[Killed] Block
MyGitHub/tp-jest/src/book.repository.js:6:21
     /**
      * @param db
      */
-    constructor(db) {
-        this.db = db;
-    }
+    constructor(db) {}
 
     save (book) {

[Killed] Block
MyGitHub/tp-jest/src/book.repository.js:10:17
         this.db = db;
     }
 
-    save (book) {
-        this.db.get('books').push(book).write();
-    }
+    save (book) {}
 
     /**

[Survived] StringLiteral
MyGitHub/tp-jest/src/book.repository.js:11:21
     }
 
     save (book) {
-        this.db.get('books').push(book).write();
+        this.db.get("").push(book).write();
     }
 

[Killed] Block
MyGitHub/tp-jest/src/book.repository.js:17:21
     /**
      * Nombre total de livre
      */
-    getTotalCount() {
-        let count = this.db.get('books').size().value();
-        return count;
-    }
+    getTotalCount() {}
 
     /**

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:25:21
     /**
      * Somme du prix de tous les livre
      */
-    getTotalPrice() {
-        let sum = 0.0;
-        for(let i of this.db.get('books').value()) {
-            let tmp = i.price;
-            sum = sum + tmp;
-        };
-        return sum;
-    }
+    getTotalPrice() {}
 
 

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:27:52
      */
     getTotalPrice() {
         let sum = 0.0;
-        for(let i of this.db.get('books').value()) {
-            let tmp = i.price;
-            sum = sum + tmp;
-        };
+        for(let i of this.db.get('books').value()) {};
         return sum;
     }

[Survived] StringLiteral
MyGitHub/tp-jest/src/book.repository.js:27:34
      */
     getTotalPrice() {
         let sum = 0.0;
-        for(let i of this.db.get('books').value()) {
+        for(let i of this.db.get("").value()) {
             let tmp = i.price;
             sum = sum + tmp;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/book.repository.js:29:19
         let sum = 0.0;
         for(let i of this.db.get('books').value()) {
             let tmp = i.price;
-            sum = sum + tmp;
+            sum = sum - tmp;
         };
         return sum;

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:38:29
     /**
      * Retourne un livre
      */
-    getBookByName(bookName) {
-        let tmp = "";
-        for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
-                return i;
-            }
-        }
-        return "book not found";
-    }
+    getBookByName(bookName) {}
 
     /**

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:40:52
      */
     getBookByName(bookName) {
         let tmp = "";
-        for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
-                return i;
-            }
-        }
+        for(let i of this.db.get('books').value()) {}
         return "book not found";
     }

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:41:40
     getBookByName(bookName) {
         let tmp = "";
         for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
-                return i;
-            }
+            while(i.name === bookName) {}
         }
         return "book not found";

[Survived] BinaryExpression
MyGitHub/tp-jest/src/book.repository.js:41:19
     getBookByName(bookName) {
         let tmp = "";
         for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
+            while(i.name !== bookName) {
                 return i;
             }

[Survived] StringLiteral
MyGitHub/tp-jest/src/book.repository.js:45:16
                 return i;
             }
         }
-        return "book not found";
+        return "";
     }
 
