[Killed] Block
MyGitHub/tp-jest/src/interval.js:2:29
 class Interval {
-    constructor(start, end) {
-        this.start = start;
-        this.end = end
-    }
+    constructor(start, end) {}
 
     // COMMAND CONSOLE FOR CODE COVERAGE "node_modules/.bin/jest --coverage"

[Survived] Block
MyGitHub/tp-jest/src/interval.js:9:16
 
     // COMMAND CONSOLE FOR CODE COVERAGE "node_modules/.bin/jest --coverage"
 
-    toString() {
-        return "[" + this.start + "," + this.end + "]";
-    }
+    toString() {}
 
     /**

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:10:16
     // COMMAND CONSOLE FOR CODE COVERAGE "node_modules/.bin/jest --coverage"
 
     toString() {
-        return "[" + this.start + "," + this.end + "]";
+        return "[" + this.start + "," + this.end - "]";
     }
 

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:10:16
     // COMMAND CONSOLE FOR CODE COVERAGE "node_modules/.bin/jest --coverage"
 
     toString() {
-        return "[" + this.start + "," + this.end + "]";
+        return "[" - this.start + "," + this.end + "]";
     }
 

[Survived] Block
MyGitHub/tp-jest/src/interval.js:27:24
      * @param {Interval} interval
      * @returns {boolean}
      */
-    overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
-    }
+    overlaps(interval) {}
 
     /**

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:28:45
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return this.end > interval.start && false;
     }
 

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:28:16
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return this.end > interval.start || this.start < interval.end;
     }
 

[Survived] Block
MyGitHub/tp-jest/src/interval.js:47:24
      * @param {Interval} interval
      * @returns {boolean}
      */
-    includes(interval) {
-        let res = Boolean;
-        if(this.start <= interval.start && this.end >= interval.end){
-            res = true;
-        } else {
-            res = false;
-        }
-        return res;
-    };
+    includes(interval) {};
 
     /**

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:49:44
      */
     includes(interval) {
         let res = Boolean;
-        if(this.start <= interval.start && this.end >= interval.end){
+        if(this.start <= interval.start && false){
             res = true;
         } else {

[Survived] IfStatement
MyGitHub/tp-jest/src/interval.js:49:12
      */
     includes(interval) {
         let res = Boolean;
-        if(this.start <= interval.start && this.end >= interval.end){
+        if(false){
             res = true;
         } else {

[Survived] BooleanSubstitution
MyGitHub/tp-jest/src/interval.js:50:19
     includes(interval) {
         let res = Boolean;
         if(this.start <= interval.start && this.end >= interval.end){
-            res = true;
+            res = false;
         } else {
             res = false;

[Survived] Block
MyGitHub/tp-jest/src/interval.js:51:16
         let res = Boolean;
         if(this.start <= interval.start && this.end >= interval.end){
             res = true;
-        } else {
-            res = false;
-        }
+        } else {}
         return res;
     };

[Survived] BooleanSubstitution
MyGitHub/tp-jest/src/interval.js:52:19
         if(this.start <= interval.start && this.end >= interval.end){
             res = true;
         } else {
-            res = false;
+            res = true;
         }
         return res;

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:77:12
         let tab_interval = [];
         let interFusion = new Interval();
         // 2 intervals sont dissociés => 
-        if(this.end <= interval.start || this.start >= interval.end) {
+        if(this.end > interval.start || this.start >= interval.end) {
             tab_interval.push(this);
             tab_interval.push(interval);

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:77:42
         let tab_interval = [];
         let interFusion = new Interval();
         // 2 intervals sont dissociés => 
-        if(this.end <= interval.start || this.start >= interval.end) {
+        if(this.end <= interval.start || this.start < interval.end) {
             tab_interval.push(this);
             tab_interval.push(interval);

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:82:17
             tab_interval.push(interval);
         // Exemple 1 (dans les 2 sens)
         } 
-        else if(this.end > interval.start) {
+        else if(this.end <= interval.start) {
             interFusion.start = this.start;
             interFusion.end = interval.end;

[Killed] IfStatement
MyGitHub/tp-jest/src/interval.js:82:17
             tab_interval.push(interval);
         // Exemple 1 (dans les 2 sens)
         } 
-        else if(this.end > interval.start) {
+        else if(false) {
             interFusion.start = this.start;
             interFusion.end = interval.end;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:87:17
             interFusion.end = interval.end;
             tab_interval.push(interFusion);
         } 
-        else if(interval.end > this.start) {
+        else if(interval.end >= this.start) {
             interFusion.start = interval.start;
             interFusion.end = this.end;

[Survived] IfStatement
MyGitHub/tp-jest/src/interval.js:87:17
             interFusion.end = interval.end;
             tab_interval.push(interFusion);
         } 
-        else if(interval.end > this.start) {
+        else if(false) {
             interFusion.start = interval.start;
             interFusion.end = this.end;

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:92:49
             interFusion.end = this.end;
             tab_interval.push(interFusion);
         }
-        else if(this.start <= interval.start && this.end >= interval.end) {
+        else if(this.start <= interval.start && true) {
             interFusion.start = this.start;
             interFusion.end = this.end;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:92:17
             interFusion.end = this.end;
             tab_interval.push(interFusion);
         }
-        else if(this.start <= interval.start && this.end >= interval.end) {
+        else if(this.start < interval.start && this.end >= interval.end) {
             interFusion.start = this.start;
             interFusion.end = this.end;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:96:49
             interFusion.start = this.start;
             interFusion.end = this.end;
         }
-        else if(interval.start <= this.start && interval.end >= this.end) {
+        else if(interval.start <= this.start && interval.end > this.end) {
             interFusion.start = interval.start;
             interFusion.end = interval.end;

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:96:49
             interFusion.start = this.start;
             interFusion.end = this.end;
         }
-        else if(interval.start <= this.start && interval.end >= this.end) {
+        else if(interval.start <= this.start && false) {
             interFusion.start = interval.start;
             interFusion.end = interval.end;

[Survived] Block
MyGitHub/tp-jest/src/interval.js:120:28
      * @param {Interval} interval 
      * @returns {Interval|null}
      */
-    intersection(interval) {
-        let tab_intersec = [];
-        let point = 0;
-        // cas NO intersection
-        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {
-            return tab_intersec;
-        }
-        // cas où les 2 intervals ont un point en commun
-        else if( (this.end-interval.start) === 0 ) {
-            return point = interval.start;
-        }
-        else if( (this.start-interval.end) === 0 ) {
-            return point = this.start;
-        }
-        // cas interection : THIS devant Interval
-        else if( (this.end-interval.start) > 0 ) {
-            return point = this.end-interval.start;
-        } 
-        // cas intersection : Interval devant THIS
-        else if( (interval.start-this.end) > 0 ) { 
-            return point = interval.end-this.start;
-        }
-    };
+    intersection(interval) {};
 
     /**

[Survived] IfStatement
MyGitHub/tp-jest/src/interval.js:124:13
         let tab_intersec = [];
         let point = 0;
         // cas NO intersection
-        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {
+        if( false ) {
             return tab_intersec;
         }

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:124:13
         let tab_intersec = [];
         let point = 0;
         // cas NO intersection
-        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {
+        if( false || (interval.end-this.start) < 0 ) {
             return tab_intersec;
         }

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:128:18
             return tab_intersec;
         }
         // cas où les 2 intervals ont un point en commun
-        else if( (this.end-interval.start) === 0 ) {
+        else if( this.end - interval.start !== 0 ) {
             return point = interval.start;
         }

[Survived] IfStatement
MyGitHub/tp-jest/src/interval.js:128:18
             return tab_intersec;
         }
         // cas où les 2 intervals ont un point en commun
-        else if( (this.end-interval.start) === 0 ) {
+        else if( false ) {
             return point = interval.start;
         }

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:131:18
         else if( (this.end-interval.start) === 0 ) {
             return point = interval.start;
         }
-        else if( (this.start-interval.end) === 0 ) {
+        else if( this.start - interval.end !== 0 ) {
             return point = this.start;
         }

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:131:19
         else if( (this.end-interval.start) === 0 ) {
             return point = interval.start;
         }
-        else if( (this.start-interval.end) === 0 ) {
+        else if( (this.start + interval.end) === 0 ) {
             return point = this.start;
         }

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:135:19
             return point = this.start;
         }
         // cas interection : THIS devant Interval
-        else if( (this.end-interval.start) > 0 ) {
+        else if( (this.end + interval.start) > 0 ) {
             return point = this.end-interval.start;
         } 

[Survived] Block
MyGitHub/tp-jest/src/interval.js:135:50
             return point = this.start;
         }
         // cas interection : THIS devant Interval
-        else if( (this.end-interval.start) > 0 ) {
-            return point = this.end-interval.start;
-        } 
+        else if( (this.end-interval.start) > 0 ) {} // cas intersection : Interval devant THIS 
         // cas intersection : Interval devant THIS
         else if( (interval.start-this.end) > 0 ) { 

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:136:28
         }
         // cas interection : THIS devant Interval
         else if( (this.end-interval.start) > 0 ) {
-            return point = this.end-interval.start;
+            return point = this.end + interval.start;
         } 
         // cas intersection : Interval devant THIS

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:139:19
             return point = this.end-interval.start;
         } 
         // cas intersection : Interval devant THIS
-        else if( (interval.start-this.end) > 0 ) { 
+        else if( (interval.start + this.end) > 0 ) { 
             return point = interval.end-this.start;
         }

[Survived] Block
MyGitHub/tp-jest/src/interval.js:139:50
             return point = this.end-interval.start;
         } 
         // cas intersection : Interval devant THIS
-        else if( (interval.start-this.end) > 0 ) { 
-            return point = interval.end-this.start;
-        }
+        else if( (interval.start-this.end) > 0 ) {}
     };
 

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:140:28
         } 
         // cas intersection : Interval devant THIS
         else if( (interval.start-this.end) > 0 ) { 
-            return point = interval.end-this.start;
+            return point = interval.end + this.start;
         }
     };

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:164:47
         let tab_exclu = [];
         const exclu1 = new Interval();
         const exclu2 = new Interval();
-        if( (interval.start-this.end) >= 0 || (this.start-interval.end) >= 0 ) {
+        if( (interval.start-this.end) >= 0 || false ) {
             tab_exclu.push(this);
             tab_exclu.push(interval);

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:164:48
         let tab_exclu = [];
         const exclu1 = new Interval();
         const exclu2 = new Interval();
-        if( (interval.start-this.end) >= 0 || (this.start-interval.end) >= 0 ) {
+        if( (interval.start-this.end) >= 0 || (this.start + interval.end) >= 0 ) {
             tab_exclu.push(this);
             tab_exclu.push(interval);

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:171:74
             console.log(tab_exclu);
             return tab_exclu;
         }
-        else if( interval.start > this.end && interval.end > this.end && this.start < interval.start) {
+        else if( interval.start > this.end && interval.end > this.end && this.start >= interval.start) {
             exclu1.start = this.start;
             exclu1.end = interval.start;

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:171:47
             console.log(tab_exclu);
             return tab_exclu;
         }
-        else if( interval.start > this.end && interval.end > this.end && this.start < interval.start) {
+        else if( interval.start > this.end && false && this.start < interval.start) {
             exclu1.start = this.start;
             exclu1.end = interval.start;

[Survived] Block
MyGitHub/tp-jest/src/interval.js:182:103
             console.log(tab_exclu);
             return tab_exclu;
         }
-        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {
-            exclu1.start = interval.start;
-            exclu1.end = this.start;
-            exclu2.start = interval.end;
-            exclu2.end = this.end;
-            tab_exclu.push(exclu1);
-            tab_exclu.push(exclu2);
-            console.log(this); console.log(interval);
-            console.log(tab_exclu);
-            return tab_exclu;
-        }
+        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {}
     };
 }

[Survived] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:182:78
             console.log(tab_exclu);
             return tab_exclu;
         }
-        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {
+        else if( this.start > interval.start && this.start < interval.end && true) {
             exclu1.start = interval.start;
             exclu1.end = this.start;
