[Killed] Block
MyGitHub/tp-jest/src/math.js:2:25
 let Util = {};
-Util.factorial = (n) => {
-    if (n === 0) {
-        return 1;
-    }
-
-    if (n >= 3000) {
-        throw 'n too large'
-    }
-
-    if (n < 0) {
-        throw 'n is negative'
-    }
-
-    return n * Util.factorial(n - 1);
-};
+Util.factorial = (n) => {};
 
 /**

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:3:9
 let Util = {};
 Util.factorial = (n) => {
-    if (n === 0) {
+    if (n !== 0) {
         return 1;
     }

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:3:9
 let Util = {};
 Util.factorial = (n) => {
-    if (n === 0) {
+    if (false) {
         return 1;
     }

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:7:9
         return 1;
     }
 
-    if (n >= 3000) {
+    if (n > 3000) {
         throw 'n too large'
     }

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:7:9
         return 1;
     }
 
-    if (n >= 3000) {
+    if (n < 3000) {
         throw 'n too large'
     }

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:11:9
         throw 'n too large'
     }
 
-    if (n < 0) {
+    if (false) {
         throw 'n is negative'
     }

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:11:9
         throw 'n too large'
     }
 
-    if (n < 0) {
+    if (n >= 0) {
         throw 'n is negative'
     }

[Killed] StringLiteral
MyGitHub/tp-jest/src/math.js:12:15
     }
 
     if (n < 0) {
-        throw 'n is negative'
+        throw ""
     }
 

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:15:31
         throw 'n is negative'
     }
 
-    return n * Util.factorial(n - 1);
+    return n * Util.factorial(n + 1);
 };
 

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:15:12
         throw 'n is negative'
     }
 
-    return n * Util.factorial(n - 1);
+    return n / Util.factorial(n - 1);
 };
 

[Killed] Block
MyGitHub/tp-jest/src/math.js:26:29
  * @param {number} n
  * @returns {boolean}
  */
-Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
-        return false;
-    }
-    if (n < 0) {
-        throw 'Unable to compute prime for n < 0'
-    }
-    for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
-    return true;
-
-};
+Util.isPrime = function (n) {};
 
 

[Killed] ConditionalExpression
MyGitHub/tp-jest/src/math.js:27:20
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (n === 1 || false) {
         return false;
     }

[Killed] Block
MyGitHub/tp-jest/src/math.js:27:29
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
-        return false;
-    }
+    if (n === 1 || n === 0) {}
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'

[Killed] BooleanSubstitution
MyGitHub/tp-jest/src/math.js:28:16
  */
 Util.isPrime = function (n) {
     if (n === 1 || n === 0) {
-        return false;
+        return true;
     }
     if (n < 0) {

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:30:9
     if (n === 1 || n === 0) {
         return false;
     }
-    if (n < 0) {
+    if (n >= 0) {
         throw 'Unable to compute prime for n < 0'
     }

[Killed] Block
MyGitHub/tp-jest/src/math.js:30:16
     if (n === 1 || n === 0) {
         return false;
     }
-    if (n < 0) {
-        throw 'Unable to compute prime for n < 0'
-    }
+    if (n < 0) {}
     for (var i = 2; i < n; i++)
         if (n % i === 0) return false;

[Killed] PostfixUnaryExpression
MyGitHub/tp-jest/src/math.js:33:28
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (var i = 2; i < n; i++)
+    for (var i = 2; i < n; i--)
         if (n % i === 0) return false;
     return true;

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:33:21
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (var i = 2; i < n; i++)
+    for (var i = 2; i >= n; i++)
         if (n % i === 0) return false;
     return true;

[Killed] BooleanSubstitution
MyGitHub/tp-jest/src/math.js:34:33
         throw 'Unable to compute prime for n < 0'
     }
     for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (n % i === 0) return true;
     return true;
 

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (true) return false;
     return true;
 

[Killed] BooleanSubstitution
MyGitHub/tp-jest/src/math.js:35:12
     }
     for (var i = 2; i < n; i++)
         if (n % i === 0) return false;
-    return true;
+    return false;
 
 };

[Killed] Block
MyGitHub/tp-jest/src/math.js:49:29
  * @param {number} n
  * @returns {number}
  */
-Util.sumPrime = function(n) {
-    let sum = 0;
-    for(let i = 2; i <= n; i++) {
-        if(Util.isPrime(i)) {
-            sum = sum + i;
-        }
-    }
-    return sum;
-};
+Util.sumPrime = function(n) {};
 
 /**

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:51:20
  */
 Util.sumPrime = function(n) {
     let sum = 0;
-    for(let i = 2; i <= n; i++) {
+    for(let i = 2; i > n; i++) {
         if(Util.isPrime(i)) {
             sum = sum + i;

[Killed] PostfixUnaryExpression
MyGitHub/tp-jest/src/math.js:51:28
  */
 Util.sumPrime = function(n) {
     let sum = 0;
-    for(let i = 2; i <= n; i++) {
+    for(let i = 2; i <= n; i--) {
         if(Util.isPrime(i)) {
             sum = sum + i;

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:52:12
 Util.sumPrime = function(n) {
     let sum = 0;
     for(let i = 2; i <= n; i++) {
-        if(Util.isPrime(i)) {
+        if(false) {
             sum = sum + i;
         }

[Killed] Block
MyGitHub/tp-jest/src/math.js:52:29
 Util.sumPrime = function(n) {
     let sum = 0;
     for(let i = 2; i <= n; i++) {
-        if(Util.isPrime(i)) {
-            sum = sum + i;
-        }
+        if(Util.isPrime(i)) {}
     }
     return sum;

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:53:19
     let sum = 0;
     for(let i = 2; i <= n; i++) {
         if(Util.isPrime(i)) {
-            sum = sum + i;
+            sum = sum - i;
         }
     }

[Killed] Block
MyGitHub/tp-jest/src/math.js:71:29
  * @param {number} n
  * @returns {array}
  */
-Util.fizzBuzz = function(n) {
-    let mon_tab = [];
-    for(let j = 1; j <= n; j++){
-        if(j % 15 == 0) {
-            mon_tab.push("FizzBuzz");
-        }
-        else if(j % 5 == 0) {
-            mon_tab.push("Buzz");
-        }
-        else if(j % 3 == 0) {
-            mon_tab.push("Fizz");
-        }
-        else {
-            mon_tab.push(j);
-        }
-    } 
-return mon_tab;
-};
+Util.fizzBuzz = function(n) {};
 
 

[Killed] BinaryExpression
MyGitHub/tp-jest/src/math.js:73:20
  */
 Util.fizzBuzz = function(n) {
     let mon_tab = [];
-    for(let j = 1; j <= n; j++){
+    for(let j = 1; j > n; j++){
         if(j % 15 == 0) {
             mon_tab.push("FizzBuzz");

[Killed] Block
MyGitHub/tp-jest/src/math.js:73:32
  */
 Util.fizzBuzz = function(n) {
     let mon_tab = [];
-    for(let j = 1; j <= n; j++){
-        if(j % 15 == 0) {
-            mon_tab.push("FizzBuzz");
-        }
-        else if(j % 5 == 0) {
-            mon_tab.push("Buzz");
-        }
-        else if(j % 3 == 0) {
-            mon_tab.push("Fizz");
-        }
-        else {
-            mon_tab.push(j);
-        }
-    } 
+    for(let j = 1; j <= n; j++){} 
 return mon_tab;
 };

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:74:12
 Util.fizzBuzz = function(n) {
     let mon_tab = [];
     for(let j = 1; j <= n; j++){
-        if(j % 15 == 0) {
+        if(true) {
             mon_tab.push("FizzBuzz");
         }

[Killed] Block
MyGitHub/tp-jest/src/math.js:74:25
 Util.fizzBuzz = function(n) {
     let mon_tab = [];
     for(let j = 1; j <= n; j++){
-        if(j % 15 == 0) {
-            mon_tab.push("FizzBuzz");
-        }
+        if(j % 15 == 0) {}
         else if(j % 5 == 0) {
             mon_tab.push("Buzz");

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:77:17
         if(j % 15 == 0) {
             mon_tab.push("FizzBuzz");
         }
-        else if(j % 5 == 0) {
+        else if(true) {
             mon_tab.push("Buzz");
         }

[Killed] Block
MyGitHub/tp-jest/src/math.js:77:29
         if(j % 15 == 0) {
             mon_tab.push("FizzBuzz");
         }
-        else if(j % 5 == 0) {
-            mon_tab.push("Buzz");
-        }
+        else if(j % 5 == 0) {}
         else if(j % 3 == 0) {
             mon_tab.push("Fizz");

[Killed] IfStatement
MyGitHub/tp-jest/src/math.js:80:17
         else if(j % 5 == 0) {
             mon_tab.push("Buzz");
         }
-        else if(j % 3 == 0) {
+        else if(true) {
             mon_tab.push("Fizz");
         }

[Killed] Block
MyGitHub/tp-jest/src/math.js:80:29
         else if(j % 5 == 0) {
             mon_tab.push("Buzz");
         }
-        else if(j % 3 == 0) {
-            mon_tab.push("Fizz");
-        }
+        else if(j % 3 == 0) {}
         else {
             mon_tab.push(j);

[Killed] StringLiteral
MyGitHub/tp-jest/src/math.js:81:26
             mon_tab.push("Buzz");
         }
         else if(j % 3 == 0) {
-            mon_tab.push("Fizz");
+            mon_tab.push("");
         }
         else {

[Killed] Block
MyGitHub/tp-jest/src/math.js:83:14
         else if(j % 3 == 0) {
             mon_tab.push("Fizz");
         }
-        else {
-            mon_tab.push(j);
-        }
+        else {}
     } 
 return mon_tab;
