[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:38:29
     /**
      * Retourne un livre
      */
-    getBookByName(bookName) {
-        for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
-                return i;
-            }
-        }
-        return "book not found";
-    }
+    getBookByName(bookName) {}
 
     /**

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:39:52
      * Retourne un livre
      */
     getBookByName(bookName) {
-        for(let i of this.db.get('books').value()) {
-            while(i.name === bookName) {
-                return i;
-            }
-        }
+        for(let i of this.db.get('books').value()) {}
         return "book not found";
     }

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:66:39
      *      ....
      *  ]
      */
-    getCountBookAddedByMont(bookName) {
-        let toto = this.db.get('books').value();
-        // const calcul = Object.values(toto).reduce(x => x.added_at.slice(0,7))
-        // console.log(calcul);
-        console.log(toto);
-        let groupBy = Object.entries(toto).reduce(function(m,d){
-            if(!m[d.id]){
-                m[d.id] = {...d, count: 1};
-                return m;
-            }
-            m[d.id].yearMonth += d.added_at.slice(0,7);
-            m[d.id].count += 1;
-        },{});
-        const result =Object.keys(groupBy).map(function(k){
-            const item = groupBy[k];
-            return {
-                year: item.yearMonth,
-                count: item.count
-            }
-        })
-    }
+    getCountBookAddedByMont(bookName) {}
 }
 

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:71:64
         // const calcul = Object.values(toto).reduce(x => x.added_at.slice(0,7))
         // console.log(calcul);
         console.log(toto);
-        let groupBy = Object.entries(toto).reduce(function(m,d){
-            if(!m[d.id]){
-                m[d.id] = {...d, count: 1};
-                return m;
-            }
-            m[d.id].yearMonth += d.added_at.slice(0,7);
-            m[d.id].count += 1;
-        },{});
+        let groupBy = Object.entries(toto).reduce(function(m,d){},{});
         const result =Object.keys(groupBy).map(function(k){
             const item = groupBy[k];

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:72:25
         // console.log(calcul);
         console.log(toto);
         let groupBy = Object.entries(toto).reduce(function(m,d){
-            if(!m[d.id]){
-                m[d.id] = {...d, count: 1};
-                return m;
-            }
+            if(!m[d.id]){}
             m[d.id].yearMonth += d.added_at.slice(0,7);
             m[d.id].count += 1;

[Survived] IfStatement
MyGitHub/tp-jest/src/book.repository.js:72:16
         // console.log(calcul);
         console.log(toto);
         let groupBy = Object.entries(toto).reduce(function(m,d){
-            if(!m[d.id]){
+            if(false){
                 m[d.id] = {...d, count: 1};
                 return m;

[Survived] ObjectLiteral
MyGitHub/tp-jest/src/book.repository.js:73:27
         console.log(toto);
         let groupBy = Object.entries(toto).reduce(function(m,d){
             if(!m[d.id]){
-                m[d.id] = {...d, count: 1};
+                m[d.id] = {};
                 return m;
             }

[Survived] Block
MyGitHub/tp-jest/src/book.repository.js:79:59
             m[d.id].yearMonth += d.added_at.slice(0,7);
             m[d.id].count += 1;
         },{});
-        const result =Object.keys(groupBy).map(function(k){
-            const item = groupBy[k];
-            return {
-                year: item.yearMonth,
-                count: item.count
-            }
-        })
+        const result =Object.keys(groupBy).map(function(k){})
     }
 }

[Survived] ObjectLiteral
MyGitHub/tp-jest/src/book.repository.js:81:20
         },{});
         const result =Object.keys(groupBy).map(function(k){
             const item = groupBy[k];
-            return {
-                year: item.yearMonth,
-                count: item.count
-            }
+            return {}
         })
     }
