[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:77:12
         let tab_interval = [];
         let interFusion = new Interval();
         // 2 intervals sont dissociés => 
-        if(this.end <= interval.start || this.start >= interval.end) {
+        if(this.end <= interval.start && this.start >= interval.end) {
             tab_interval.push(this);
             tab_interval.push(interval);

[Killed] Block
MyGitHub/tp-jest/src/interval.js:125:78
         let point = 0;
         let interSection = new Interval();
         // cas NO intersection
-        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {
-            return tab_intersec;
-        }
+        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {} // cas où les 2 intervals ont un point en commun
         // cas où les 2 intervals ont un point en commun
         else if( (this.end-interval.start) === 0 ) {

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:125:13
         let point = 0;
         let interSection = new Interval();
         // cas NO intersection
-        if( (this.end-interval.start) < 0 || (interval.end-this.start) < 0 ) {
+        if( this.end - interval.start < 0 && interval.end - this.start < 0 ) {
             return tab_intersec;
         }

[Killed] IfStatement
MyGitHub/tp-jest/src/interval.js:129:18
             return tab_intersec;
         }
         // cas où les 2 intervals ont un point en commun
-        else if( (this.end-interval.start) === 0 ) {
+        else if( true ) {
             return point = interval.start;
         }

[Killed] IfStatement
MyGitHub/tp-jest/src/interval.js:132:18
         else if( (this.end-interval.start) === 0 ) {
             return point = interval.start;
         }
-        else if( (this.start-interval.end) === 0 ) {
+        else if( true ) {
             return point = this.start;
         }

[Killed] IfStatement
MyGitHub/tp-jest/src/interval.js:136:18
             return point = this.start;
         }
         // cas interection : THIS devant Interval
-        else if( (this.end-interval.start) > 0 ) {
+        else if( false ) {
             interSection.start = this.start;
             interSection.end = interval.end;

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:136:18
             return point = this.start;
         }
         // cas interection : THIS devant Interval
-        else if( (this.end-interval.start) > 0 ) {
+        else if( this.end - interval.start <= 0 ) {
             interSection.start = this.start;
             interSection.end = interval.end;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:142:18
             return interSection;
         } 
         // cas intersection : Interval devant THIS
-        else if( (interval.start-this.end) > 0 ) { 
+        else if( interval.start - this.end >= 0 ) { 
             interSection.start = interval.start;
             interSection.end = this.end;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:142:18
             return interSection;
         } 
         // cas intersection : Interval devant THIS
-        else if( (interval.start-this.end) > 0 ) { 
+        else if( interval.start - this.end <= 0 ) { 
             interSection.start = interval.start;
             interSection.end = this.end;

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:169:14
         let tab_exclu = [];
         const exclu1 = new Interval();
         const exclu2 = new Interval();
-        if( (interval.start-this.end) >= 0 || (this.start-interval.end) >= 0 ) {
+        if( (interval.start + this.end) >= 0 || (this.start-interval.end) >= 0 ) {
             tab_exclu.push(this);
             tab_exclu.push(interval);

[Killed] BinaryExpression
MyGitHub/tp-jest/src/interval.js:169:47
         let tab_exclu = [];
         const exclu1 = new Interval();
         const exclu2 = new Interval();
-        if( (interval.start-this.end) >= 0 || (this.start-interval.end) >= 0 ) {
+        if( (interval.start-this.end) >= 0 || this.start - interval.end < 0 ) {
             tab_exclu.push(this);
             tab_exclu.push(interval);

[Killed] IfStatement
MyGitHub/tp-jest/src/interval.js:174:18
             tab_exclu.push(interval);
             return tab_exclu;
         }
-        else if( interval.start > this.end && interval.end > this.end && this.start < interval.start) {
+        else if( true) {
             exclu1.start = this.start;
             exclu1.end = interval.start;

[Survived] BinaryExpression
MyGitHub/tp-jest/src/interval.js:174:18
             tab_exclu.push(interval);
             return tab_exclu;
         }
-        else if( interval.start > this.end && interval.end > this.end && this.start < interval.start) {
+        else if( interval.start >= this.end && interval.end > this.end && this.start < interval.start) {
             exclu1.start = this.start;
             exclu1.end = interval.start;

[Killed] ConditionalExpression
MyGitHub/tp-jest/src/interval.js:183:78
             tab_exclu.push(exclu2);
             return tab_exclu;
         }
-        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {
+        else if( this.start > interval.start && this.start < interval.end && false) {
             exclu1.start = interval.start;
             exclu1.end = this.start;

[Killed] Block
MyGitHub/tp-jest/src/interval.js:183:103
             tab_exclu.push(exclu2);
             return tab_exclu;
         }
-        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {
-            exclu1.start = interval.start;
-            exclu1.end = this.start;
-            exclu2.start = interval.end;
-            exclu2.end = this.end;
-            tab_exclu.push(exclu1);
-            tab_exclu.push(exclu2);
-            return tab_exclu;
-        }
+        else if( this.start > interval.start && this.start < interval.end && this.end > interval.end) {}
     };
 }
